# =================================================================
#
#   □□□ 最初にご確認ください □□□
#
#   本スクリプトはフリーソフトです。著作権は放棄していません。
#   非営利目的で使用される場合に限り、自由に使用、カスタマイズ、
#   再配布可能です。
#
#   尚、このスクリプトを使用したいかなる損害に対して、著作者は
#   一切その責を負いません。
#
# =================================================================
#
#	=============== Zumin - ゲストブック１号 ===============
#
#   Copyright(c) 2001-  Zumin., All rights reserved.
#
#   Email : mailto:webmaster@zumin.cside9.com
#   URL   : http://zumin.cside9.com/zumin/
#
# =================================================================


###################################################################
#
#	Guest Book カスタマイズ可能変数（お好みで書き換え可）
#
###################################################################

# ===========================================================
# HomeへのURL
# ===========================================================
$HomeURL = '/home/index.html';

# ===========================================================
# ゲストブックログ件数最大数 [ 1 ～ 512 ]
# □ 推奨 256くらい。
# □ あんまり多いとサーバーに負荷がかかります）
# ----------------------------------------------------
# 投稿ログに蓄積されたものが、この数を超える場合、古い
# ものから削除されます。
# ----------------------------------------------------
# 尚、投稿ログのシリアル（通し）番号はこの数に関係なく
# 継続してカウントされます。
# ===========================================================
$MaxLogCount = 256;

# ===========================================================
# ページの背景色 （<body> タグの bgcolor属性）
# ===========================================================
$UserBgColor = '#FFFFFF';

# ===========================================================
# ページの背景画像（<body> タグの background属性）
# ----------------------------------------------------
# 画像ファイルは img ディレクトリに配置してください。
# ===========================================================
$UserBgImg = 'user_backgroung.gif';

# ===========================================================
# ページ本文の文字色（<body> タグの text属性）
# ===========================================================
$UserFgColor = '#3080C0';

# ===========================================================
# ページタイトル文字列・色
# ===========================================================
$UserTitle      = 'ゲストブックにようこそ';
$UserTitleColor = '#3080C0';

# ===========================================================
# ページタイトルバナー画像
# ----------------------------------------------------
# 画像ファイルは img ディレクトリに配置してください。
# ===========================================================
$UserTitleImg = '';


# ===========================================================
# 投稿メッセージ文字表示色。１～10色まで指定可能。
# ----------------------------------------------------
# 全てに指定する必要はない。8 色でOKの場合 1～8まで設定し、
# あとはコメント（行頭に#を入れる）にして下さい。
# ===========================================================
$UserLogColor_1  = '#000000';
$UserLogColor_2  = '#0000FF';
$UserLogColor_3  = '#4488CC';
$UserLogColor_4  = '#44CC88';
$UserLogColor_5  = '#888800';
$UserLogColor_6  = '#CC8844';
$UserLogColor_7  = '#CC4488';
$UserLogColor_8  = '#FF0000';
# $UserLogColor_9  = '';
# $UserLogColor_10 = '';

# ===========================================================
# 投稿メッセージに表示するアイコン。１～30まで指定可能。
# ----------------------------------------------------
# 全てに指定する必要はない。7つでOKの場合１～7 まで設定し、
# あとはコメント（行頭に#を入れる）にして下さい。
# 画像ファイルは img ディレクトリに配置してください。
# ===========================================================
$UserLogIcon_1  = 'user_icon_1.gif';
$UserLogIcon_2  = 'user_icon_2.gif';
$UserLogIcon_3  = 'user_icon_3.gif';
$UserLogIcon_4  = 'user_icon_4.gif';
$UserLogIcon_5  = 'user_icon_5.gif';
$UserLogIcon_6  = 'user_icon_6.gif';
$UserLogIcon_7  = 'user_icon_7.gif';
# $UserLogIcon_8  = '';
# $UserLogIcon_9  = '';
# $UserLogIcon_10 = '';
# $UserLogIcon_11 = '';
# $UserLogIcon_12 = '';
# $UserLogIcon_13 = '';
# $UserLogIcon_14 = '';
# $UserLogIcon_15 = '';
# $UserLogIcon_16 = '';
# $UserLogIcon_17 = '';
# $UserLogIcon_18 = '';
# $UserLogIcon_19 = '';
# $UserLogIcon_20 = '';
# $UserLogIcon_21 = '';
# $UserLogIcon_22 = '';
# $UserLogIcon_23 = '';
# $UserLogIcon_24 = '';
# $UserLogIcon_25 = '';
# $UserLogIcon_26 = '';
# $UserLogIcon_27 = '';
# $UserLogIcon_28 = '';
# $UserLogIcon_29 = '';
# $UserLogIcon_30 = '';

# ===========================================================
# 投稿メッセージのメール部分に表示するアイコン。
# ----------------------------------------------------
# 画像ファイルは img ディレクトリに配置してください。
# ===========================================================
$UserLogMailIcon = 'user_mail.gif';

# ===========================================================
# 投稿メッセージのホーム部分に表示するアイコン。
# ----------------------------------------------------
# 画像ファイルは img ディレクトリに配置してください。
# ===========================================================
$UserLogHomeIcon = 'user_home.gif';


# ===========================================================
# 投稿ログ 1ページあたりの表示件数 [ 1 ～ 100 ]
# ===========================================================
$LogDisplayCount = 11;

# ===========================================================
# 投稿ログ表示部分背景色（新規投稿の場合）
# ===========================================================
$UserLogBgColor = '#FFFFE8';

# ===========================================================
# 投稿ログ表示部分背景色（返信の場合）
# ===========================================================
$UserLogResBgColor = '#FFEEEE';



###################################################################
#
#	管理者メニューカスタマイズ可能変数（お好みで書き換え可）
#
###################################################################

# ===========================================================
# 管理者の名前
# ===========================================================
$AdminUserName = '管理者';

# ===========================================================
# 管理者の性別 [男:0 女:1]
# ===========================================================
$AdminUserSex = '0';

# ===========================================================
# 管理者のEmail
# ===========================================================
$AdminUserEmail = 'webmaster@zumin.cside9.com';

# ===========================================================
# 管理者のHPトップページURL
# ----------------------------------------------------
# こちらは絶対パス（http:// から）で記述してください。
# ===========================================================
$AdminUserHpURL = 'http://zumin.cside9.com/';

# ===========================================================
# 管理者のHP名称
# ===========================================================
$AdminUserHpName = 'Zumin';

# ===========================================================
#  管理ツールアクセス時パスワード
# ----------------------------------------------------
#  アクセスログ管理ツールを使用する場合このパスワード
#  で管理者の認証をおこないます。
#  他人から盗まれないよう注意してください。
#  英数字（半角)4桁～16桁で指定してください。
# ===========================================================
$AdminPasswd = 'guest';

# ===========================================================
#  管理ツールアクセス時パスワード暗号化キー
# ----------------------------------------------------
#  アクセスログ管理ツールのパスワードを暗号化する時
#  の暗号カギです。
#  他人から盗まれないよう注意してください。
#  英数字（半角)4桁～16桁で指定してください。
# ===========================================================
$CriptKey = 'password_key';


###################################################################
#	以下の行は触らないで！！
###################################################################
1
