# =================================================================
#
#   □□□ 最初にご確認ください □□□
#
#   本スクリプトはフリーソフトです。著作権は放棄していません。
#   非営利目的で使用される場合に限り、自由に使用、カスタマイズ、
#   再配布可能です。
#
#   尚、このスクリプトを使用したいかなる損害に対して、著作者は
#   一切その責を負いません。
#
# =================================================================
#
#   =============== Zumin - カウンター２号 ===============
#
#   userdef.pm
#
#   Copyright(c) 2001-  Zumin., All rights reserved.
#
#   Email : mailto:webmaster@zumin.cside9.com
#   URL   : http://zumin.cside9.com/zumin/
#
# =================================================================


###################################################################
#
#   カスタマイズ可能変数（お好みで書き換え可）
#
###################################################################

# ===========================================================
#               ☆☆☆ $HomeURL ☆☆☆
# ----------------------------------------------------
#  あなたのホームページのHOMEへのURLです。
# ===========================================================
$HomeURL = '/Home/index.html';


# ===========================================================
#               ☆☆☆ $CounterSize ☆☆☆
# ----------------------------------------------------
#  カウンターの表示桁数です。
#  1 以上、16 以内で設定してください。
#  上記範囲外ですとディフォルトの 6 桁となります。
# ===========================================================
$CounterSize = 5;


# ===========================================================
#               ☆☆☆ $CheckHomonymIp ☆☆☆
# ----------------------------------------------------
#  同一IPアドレスの場合はカウントしないようプログラム
#  でチェックする設定です。
# ----------------------------------------------------
#   1 : チェックします。
#       同一IPアドレスの場合はカウントしなくなります。
#   0 : チェックしません。
#       同一IPアドレスの場合でもカウントします。
# ===========================================================
$CheckHomonymIp = 1;


# ===========================================================
#               ☆☆☆ $NoCountSpan ☆☆☆
# ----------------------------------------------------
#  同一IPアドレスのチェックするとき、前回のアクセス
#  から一定時間経過したら、たとえ、同一IPアドレスか
#  らのアクセスであってもカウンタを進めたい場合に、
#  その一定時間を分（Minutes)で設定できます。
# ----------------------------------------------------
#   注意：
#   上記、$CheckHomonymIp を 0 に設定した場合、ここ
#   にどんな値を設定しても無効です。
# ----------------------------------------------------
#   注意：
#   上記、$CheckHomonymIp を 1 に設定し、且つ、
#   $NoCountSpan を 0 に設定した場合は、何時間たって
#   も、他の誰か、つまり、異なるIPアドレスからのアク
#   セスがない限り、カウンタは進みません。
# ===========================================================
$NoCountSpan = 15;


# ===========================================================
#               ☆☆☆ $AccessLogMax ☆☆☆
# ----------------------------------------------------
#  アクセスログ件数上限
#  この上限値を超えるタイミングで、アクセスログが一旦
#  クリアされます。それまでのログは破棄されます。
# ===========================================================
$AccessLogMax = 1024;


# ===========================================================
#               ☆☆☆ $AdminPasswd ☆☆☆
# ----------------------------------------------------
#  アクセスログ管理ツールアクセス時パスワード
# ----------------------------------------------------
#  アクセスログ管理ツールを使用する場合このパスワード
#  で管理者の認証をおこないます。
#  他人から盗まれないよう注意してください。
# ----------------------------------------------------
#  英数字（ASCII)4桁～16桁で指定してください。
# ===========================================================
$AdminPasswd = 'guest';

# ===========================================================
#               ☆☆☆ $CriptKey ☆☆☆
# ----------------------------------------------------
#  アクセスログ管理ツールアクセス時パスワード
#  暗号化キー
# ----------------------------------------------------
#  アクセスログ管理ツールのパスワードを暗号化する時
#  の暗号カギです。
#  他人から盗まれないよう注意してください。
# ----------------------------------------------------
#  英数字（半角)4桁～16桁で指定してください。
# ===========================================================
$CriptKey = 'password_key';



###################################################################
#   以下の行は触らないで！！
###################################################################
1
